# Importamos las librerias

In [2]:
import pandas as pd
import numpy as np

# Dataset de prueba

In [3]:
data = {
    "Nombre": ["Ana", "Luis", "María", "Carlos", "Ana"],
    "Edad": [23, 30, 27, 40, 23],
    "Ciudad": ["CDMX", "GDL", "Monterrey", "CDMX", "CDMX"],
    "Salario": [15000, 18000, 17000, 22000, 15000]
}

df = pd.DataFrame(data)
df

   Nombre  Edad     Ciudad  Salario
0     Ana    23       CDMX    15000
1    Luis    30        GDL    18000
2   María    27  Monterrey    17000
3  Carlos    40       CDMX    22000
4     Ana    23       CDMX    15000

## Ejemplo: Creación de nuevas columnas

In [6]:
# Salario anual
df["Salario_anual"] = df["Salario"] * 12
df

   Nombre  Edad     Ciudad  Salario  Salario_anual
0     Ana    23       CDMX    15000         180000
1    Luis    30        GDL    18000         216000
2   María    27  Monterrey    17000         204000
3  Carlos    40       CDMX    22000         264000
4     Ana    23       CDMX    15000         180000

In [7]:
# Clasificar empleados por edad:
df["Categoria_Edad"] = np.where(df["Edad"] >= 30, "Adulto", "Joven")
df

   Nombre  Edad     Ciudad  Salario  Salario_anual Categoria_Edad
0     Ana    23       CDMX    15000         180000          Joven
1    Luis    30        GDL    18000         216000         Adulto
2   María    27  Monterrey    17000         204000          Joven
3  Carlos    40       CDMX    22000         264000         Adulto
4     Ana    23       CDMX    15000         180000          Joven

 ## Ejemplo: Transformaciones con apply() y lambda

In [8]:
# Convertir nombres a mayúsculas
df["Nombre_mayus"] = df["Nombre"].apply(lambda x: x.upper())
df

   Nombre  Edad     Ciudad  Salario  Salario_anual Categoria_Edad Nombre_mayus
0     Ana    23       CDMX    15000         180000          Joven          ANA
1    Luis    30        GDL    18000         216000         Adulto         LUIS
2   María    27  Monterrey    17000         204000          Joven        MARÍA
3  Carlos    40       CDMX    22000         264000         Adulto       CARLOS
4     Ana    23       CDMX    15000         180000          Joven          ANA

# Crear una función personalizada
def clasificar_salario(sal):
    if sal < 16000:
        return "Bajo"
    elif sal < 20000:
        return "Medio"
    else:
        return "Alto"

df["Nivel_salario"] = df["Salario"].apply(clasificar_salario)
df

## Ejemplo: Reemplazo de valores con map() o replace()

In [14]:
# Reemplazo con map() // Convertir ciudades a completo
ciudades_map = {
    "CDMX": "Ciudad de Mexico",
    "GDL": "Guadalajara",
    "Monterrey": "MTY"
}

df["Ciudad_invertido"] = df["Ciudad"].map(ciudades_map)
df

,Nombre,Edad,Ciudad,Salario,Salario_anual,Categoria_Edad,Nombre_mayus,Nivel_salario,Ciudad_invertido
0,Ana,23,CDMX,15000,180000,Joven,ANA,Bajo,Ciudad de Mexico
1,Luis,30,GDL,18000,216000,Adulto,LUIS,Medio,Guadalajara
2,María,27,Monterrey,17000,204000,Joven,MARÍA,Medio,MTY
3,Carlos,40,CDMX,22000,264000,Adulto,CARLOS,Alto,Ciudad de Mexico
4,Ana,23,CDMX,15000,180000,Joven,ANA,Bajo,Ciudad de Mexico

In [15]:
# Reemplazo con replace() // Cambiar etiquetas de categoría
df["Categoria_Edad"] = df["Categoria_Edad"].replace({"Joven": "J", "Adulto": "A"})
df

,Nombre,Edad,Ciudad,Salario,Salario_anual,Categoria_Edad,Nombre_mayus,Nivel_salario,Ciudad_invertido
0,Ana,23,CDMX,15000,180000,J,ANA,Bajo,Ciudad de Mexico
1,Luis,30,GDL,18000,216000,A,LUIS,Medio,Guadalajara
2,María,27,Monterrey,17000,204000,J,MARÍA,Medio,MTY
3,Carlos,40,CDMX,22000,264000,A,CARLOS,Alto,Ciudad de Mexico
4,Ana,23,CDMX,15000,180000,J,ANA,Bajo,Ciudad de Mexico